import { motion } from "framer-motion";
import { useEffect, useRef } from "react";
import styled from "styled-components";

const Wrapper = styled(motion.div)`
  z-index: 3;
  position: absolute;
  top: 100px;
  right: 20px;
  width: 280px;
  display: flex;
  flex-direction: column;
  background: ${(props) => props.theme.ContainColor};
  color: ${(props) => props.theme.textColor};
  padding: 20px;
  border-radius: var(--border-radius-30);
  box-shadow: 0 0 8px rgba(0, 0, 0, 0.1);
  max-height: 80vh; /* 모달 콘텐츠의 최대 높이 */
  overflow-y: auto;
  -ms-overflow-style: none; /* IE, Edge */
  scrollbar-width: none;
  cursor: pointer;
  @media screen and (max-width: 1050px) {
    right: 10px;
  }
  @media screen and (max-width: 768px) {
    width: 330px;
    top: 70px;
  }
`;

const Item = styled.div`
  border-radius: 8px;
  padding: 10px 0;
  display: flex;
  padding-left: 30px;
  align-items: center;
  gap: 30px;
  transition: all 0.3s;
  &:hover {
    background-color: ${(props) => props.theme.cardColor};
    color: ${(props) => props.theme.subTextColor};
  }
  svg {
    width: 40px;
  }
`;
/* eslint-disable react/prop-types */
const SideBarMenu = ({ openGroup, closeModal, sideMenuOpen }) => {
  const closeRef = useRef(null);
  const handleClickOutside = (event) => {
    if (closeRef.current && !closeRef.current.contains(event.target)) {
      closeModal(); // 모달을 닫는 함수 호출
    }
  };
  useEffect(() => {
    document.addEventListener("click", handleClickOutside);
    return () => {
      document.removeEventListener("click", handleClickOutside);
    };
  }, []);

  return (
    <Wrapper
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
      transition={{ duration: 0.2 }}
      ref={closeRef}
      onClick={(e) => e.stopPropagation()}
    >
      <Item onClick={openGroup}>
        <svg
          width="36"
          height="36"
          viewBox="0 0 36 36"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_i_948_2780)">
            <circle
              cx="18"
              cy="18"
              r="17.5"
              fill="url(#paint0_linear_948_2780)"
            />
          </g>
          <circle cx="18.0007" cy="12.4319" r="3.97727" fill="white" />
          <circle cx="26.3519" cy="16.0116" r="1.98864" fill="#D9D9D9" />
          <circle cx="9.64879" cy="16.0116" r="1.98864" fill="#D9D9D9" />
          <path
            d="M10.0469 24.0228C10.0469 20.2572 13.0995 17.2046 16.8651 17.2046H19.1378C22.9034 17.2046 25.956 20.2572 25.956 24.0228C25.956 25.529 24.7349 26.75 23.2287 26.75H12.7741C11.2679 26.75 10.0469 25.529 10.0469 24.0228Z"
            fill="white"
          />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M26.9153 24.3636H29.9312C30.8098 24.3636 31.5221 23.6513 31.5221 22.7727C31.5221 20.5761 29.7414 18.7954 27.5448 18.7954H25.2137C25.0463 18.7954 24.8833 18.814 24.7266 18.8493C26.0819 20.0495 26.9364 21.8027 26.9364 23.7555V24.0227C26.9364 24.1381 26.9292 24.2519 26.9153 24.3636Z"
            fill="#D9D9D9"
          />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M9.08473 24.3636H6.06883C5.1902 24.3636 4.47792 23.6513 4.47792 22.7727C4.47792 20.5761 6.25861 18.7954 8.45519 18.7954H10.7863C10.9537 18.7954 11.1167 18.814 11.2734 18.8493C9.91805 20.0495 9.06363 21.8027 9.06363 23.7555V24.0227C9.06363 24.1381 9.07081 24.2519 9.08473 24.3636Z"
            fill="#D9D9D9"
          />
          <defs>
            <filter
              id="filter0_i_948_2780"
              x="0.5"
              y="0.5"
              width="38"
              height="40"
              filterUnits="userSpaceOnUse"
              colorInterpolationFilters="sRGB"
            >
              <feFlood floodOpacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feColorMatrix
                in="SourceAlpha"
                type="matrix"
                values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                result="hardAlpha"
              />
              <feOffset dx="3" dy="5" />
              <feGaussianBlur stdDeviation="5" />
              <feComposite
                in2="hardAlpha"
                operator="arithmetic"
                k2="-1"
                k3="1"
              />
              <feColorMatrix
                type="matrix"
                values="0 0 0 0 0.0588235 0 0 0 0 0.0862745 0 0 0 0 0.117647 0 0 0 0.08 0"
              />
              <feBlend
                mode="normal"
                in2="shape"
                result="effect1_innerShadow_948_2780"
              />
            </filter>
            <linearGradient
              id="paint0_linear_948_2780"
              x1="18"
              y1="0.5"
              x2="18"
              y2="35.5"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#1F80FF" />
              <stop offset="1" stopColor="#0051B9" />
            </linearGradient>
          </defs>
        </svg>
        <span>그룹</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="34"
          height="34"
          viewBox="0 0 34 34"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M16.9991 0.120117C7.88848 0.120117 0.5 7.11398 0.5 15.7471C0.5 20.6535 2.89061 25.0347 6.63114 27.8986V33.8797L12.2623 30.7157C13.7641 31.1433 15.351 31.3721 17.0009 31.3721C26.1115 31.3721 33.5 24.3764 33.5 15.7471C33.4981 7.11398 26.1097 0.120117 16.9991 0.120117ZM18.736 21.0736L14.4677 16.5835L6.24968 21.1861L15.2584 11.5027L19.5267 15.9946L27.7466 11.3902L18.736 21.0736Z"
            fill="url(#paint0_linear_948_2757)"
          />
          <defs>
            <linearGradient
              id="paint0_linear_948_2757"
              x1="17"
              y1="0.120117"
              x2="17"
              y2="33.8797"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#0189F8" />
              <stop offset="1" stopColor="#015192" />
            </linearGradient>
          </defs>
        </svg>
        <span>Messenger</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="36"
          height="26"
          viewBox="0 0 36 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M17.9081 23.1613C17.9081 23.1613 16.3086 23.1613 16.3086 21.5619C16.3086 19.9624 17.9081 15.164 25.9054 15.164C33.9027 15.164 35.5021 19.9624 35.5021 21.5619C35.5021 23.1613 33.9027 23.1613 33.9027 23.1613H17.9081ZM25.9054 13.5645C27.178 13.5645 28.3985 13.059 29.2983 12.1591C30.1982 11.2593 30.7038 10.0388 30.7038 8.76616C30.7038 7.49355 30.1982 6.27306 29.2983 5.37319C28.3985 4.47332 27.178 3.96777 25.9054 3.96777C24.6328 3.96777 23.4123 4.47332 22.5124 5.37319C21.6125 6.27306 21.107 7.49355 21.107 8.76616C21.107 10.0388 21.6125 11.2593 22.5124 12.1591C23.4123 13.059 24.6328 13.5645 25.9054 13.5645Z"
            fill="url(#paint0_linear_948_2761)"
          />
          <path
            d="M2.5779 25.4193C2.5779 25.4193 0.5 25.4193 0.5 23.3494C0.5 21.2795 2.5779 15.0698 12.9674 15.0698C23.3569 15.0698 25.4348 21.2795 25.4348 23.3494C25.4348 25.4193 23.3569 25.4193 23.3569 25.4193H2.5779ZM12.9674 12.9999C14.6207 12.9999 16.2063 12.3457 17.3753 11.1811C18.5444 10.0166 19.2011 8.43715 19.2011 6.79024C19.2011 5.14333 18.5444 3.56388 17.3753 2.39934C16.2063 1.2348 14.6207 0.580566 12.9674 0.580566C11.3141 0.580566 9.72857 1.2348 8.55952 2.39934C7.39047 3.56388 6.73371 5.14333 6.73371 6.79024C6.73371 8.43715 7.39047 10.0166 8.55952 11.1811C9.72857 12.3457 11.3141 12.9999 12.9674 12.9999Z"
            fill="url(#paint1_linear_948_2761)"
          />
          <defs>
            <linearGradient
              id="paint0_linear_948_2761"
              x1="31.5505"
              y1="5.66132"
              x2="21.3892"
              y2="20.9033"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#4AFFAB" />
              <stop offset="1" stopColor="#2D9966" />
            </linearGradient>
            <linearGradient
              id="paint1_linear_948_2761"
              x1="21.3871"
              y1="1.14508"
              x2="6.14516"
              y2="23.7257"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#1877F2" />
              <stop offset="1" stopColor="#0E458C" />
            </linearGradient>
          </defs>
        </svg>
        <span>친구</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="30"
          height="30"
          viewBox="0 0 30 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M3.20923 5.72665C5.95376 2.24149 10.2155 0 15 0C23.2843 0 30 6.71573 30 15C30 23.2843 23.2843 30 15 30C6.71573 30 0 23.2843 0 15C0 14.3096 0.559644 13.75 1.25 13.75C1.94036 13.75 2.5 14.3096 2.5 15C2.5 21.9036 8.09644 27.5 15 27.5C21.9036 27.5 27.5 21.9036 27.5 15C27.5 8.09644 21.9036 2.5 15 2.5C11.0141 2.5 7.46423 4.36423 5.17333 7.27335L3.20923 5.72665Z"
            fill="#0966FF"
          />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M15.25 6.81836C15.9404 6.81836 16.5 7.378 16.5 8.06836V14.757L20.5805 18.3841C21.0964 18.8427 21.1429 19.6328 20.6843 20.1488C20.2256 20.6648 19.4355 20.7113 18.9195 20.2526L14.4195 16.2526C14.1527 16.0154 14 15.6754 14 15.3184V8.06836C14 7.378 14.5596 6.81836 15.25 6.81836Z"
            fill="#0966FF"
          />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M3.97656 0.681641C4.66692 0.681641 5.22656 1.24128 5.22656 1.93164V5.68164H8.97656C9.66692 5.68164 10.2266 6.24128 10.2266 6.93164C10.2266 7.622 9.66692 8.18164 8.97656 8.18164H3.97656C3.28621 8.18164 2.72656 7.622 2.72656 6.93164V1.93164C2.72656 1.24128 3.28621 0.681641 3.97656 0.681641Z"
            fill="#0966FF"
          />
        </svg>

        <span>과거의 오늘</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="24"
          height="36"
          viewBox="0 0 24 36"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M23.375 35.5L12 25.7778L0.625 35.5V4.38889C0.625 3.35749 0.96741 2.36834 1.5769 1.63903C2.1864 0.909721 3.01305 0.5 3.875 0.5H20.125C20.987 0.5 21.8136 0.909721 22.4231 1.63903C23.0326 2.36834 23.375 3.35749 23.375 4.38889V35.5Z"
            fill="url(#paint0_linear_948_2776)"
          />
          <defs>
            <linearGradient
              id="paint0_linear_948_2776"
              x1="12"
              y1="0.5"
              x2="12"
              y2="35.5"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#008DFF" />
              <stop offset="1" stopColor="#003A69" />
            </linearGradient>
          </defs>
        </svg>

        <span>저장됨</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="28"
          height="26"
          viewBox="0 0 28 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M24.5 0.75H19.7914L19.7367 0.804688L12.7914 7.75H17.8281L17.8828 7.69531L24.8172 0.766406C24.7133 0.755469 24.6094 0.75 24.5 0.75ZM28 7.75V4.25C28 3.42422 27.7102 2.65859 27.2344 2.0625L21.5469 7.75H28ZM16.0836 0.75H11.0469L10.9922 0.804688L4.04141 7.75H9.07812L9.13281 7.69531L16.0781 0.75H16.0836ZM3.5 0.75C1.56953 0.75 0 2.31953 0 4.25V7.75H0.333594L0.388281 7.69531L7.33359 0.75H3.5ZM28 9.5H0V21.75C0 23.6805 1.56953 25.25 3.5 25.25H24.5C26.4305 25.25 28 23.6805 28 21.75V9.5Z"
            fill="#1A74E4"
          />
        </svg>

        <span>동영상</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="36"
          height="26"
          viewBox="0 0 36 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <rect
            x="0.5"
            y="0.229492"
            width="35"
            height="25.5405"
            rx="5"
            fill="url(#paint0_linear_948_2804)"
          />
          <rect
            x="4.28516"
            y="3.06738"
            width="6.62162"
            height="7.56757"
            rx="2"
            fill="#06429D"
          />
          <rect
            x="11.8516"
            y="4.01318"
            width="19.8649"
            height="1.89189"
            rx="0.945946"
            fill="#064CA4"
          />
          <rect
            x="11.8516"
            y="6.85107"
            width="7.56757"
            height="1.89189"
            rx="0.945946"
            fill="#064CA4"
          />
          <defs>
            <linearGradient
              id="paint0_linear_948_2804"
              x1="18"
              y1="0.229492"
              x2="18"
              y2="25.77"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="white" />
              <stop offset="0.63" stopColor="white" />
              <stop offset="0.6301" stopColor="#06419C" />
              <stop offset="1" stopColor="#0651A8" />
            </linearGradient>
          </defs>
        </svg>

        <span>피드</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="36"
          height="36"
          viewBox="0 0 36 36"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_i_948_2813)">
            <circle cx="18" cy="18" r="17.5" fill="white" />
          </g>
          <circle cx="18" cy="18" r="17" stroke="#E3E6EA" />
          <path
            d="M29.8834 14.7206C29.8834 14.1767 29.6673 13.655 29.2827 13.2704C28.8981 12.8858 28.3765 12.6698 27.8326 12.6698H26.0936C26.3475 12.1605 26.4768 11.5982 26.4709 11.0292C26.4774 10.5467 26.388 10.0678 26.2079 9.62023C26.0278 9.17265 25.7605 8.7653 25.4217 8.42186C25.0828 8.07843 24.6791 7.80573 24.234 7.61963C23.7889 7.43352 23.3112 7.33771 22.8287 7.33775C21.8093 7.30221 20.7968 7.51868 19.8811 7.96798C18.9653 8.41728 18.1745 9.08554 17.5787 9.91353C16.983 9.08554 16.1922 8.41728 15.2764 7.96798C14.3606 7.51868 13.3481 7.30221 12.3287 7.33775C11.3627 7.33775 10.4363 7.72148 9.7533 8.40452C9.07026 9.08757 8.68653 10.014 8.68653 10.9799C8.68061 11.549 8.80994 12.1113 9.06387 12.6206H7.32481C7.05131 12.6205 6.78055 12.6751 6.52847 12.7812C6.2764 12.8874 6.0481 13.0428 5.85701 13.2385C5.66592 13.4342 5.5159 13.6661 5.41578 13.9206C5.31566 14.1752 5.26746 14.4471 5.27403 14.7206V18.8221H7.32481V26.6807C7.34186 27.2132 7.56542 27.7181 7.94819 28.0886C8.33095 28.4591 8.84287 28.6661 9.37559 28.6659H25.7818C26.3257 28.6659 26.8474 28.4498 27.232 28.0652C27.6166 27.6806 27.8326 27.159 27.8326 26.6151V18.7565H29.8834V14.7206ZM22.8287 9.38853C23.2638 9.38853 23.6811 9.56138 23.9888 9.86906C24.2965 10.1767 24.4693 10.594 24.4693 11.0292C24.4693 11.4643 24.2965 11.8816 23.9888 12.1893C23.6811 12.4969 23.2638 12.6698 22.8287 12.6698H18.6943C18.8407 11.7014 19.3486 10.8244 20.1158 10.2155C20.8829 9.60664 21.8524 9.31114 22.8287 9.38853ZM12.3287 9.38853C13.3051 9.31114 14.2745 9.60664 15.0417 10.2155C15.8088 10.8244 16.3168 11.7014 16.4631 12.6698H12.3287C11.9662 12.5872 11.6426 12.3839 11.4107 12.0933C11.1789 11.8027 11.0526 11.4419 11.0526 11.0702C11.0526 10.6984 11.1789 10.3377 11.4107 10.0471C11.6426 9.75643 11.9662 9.55317 12.3287 9.47056V9.38853ZM7.32481 14.7206H14.4943V16.7057H7.32481V14.7206ZM14.4943 26.6807H9.37559V18.7565H14.4943V26.6807ZM16.5615 26.6807V14.7206H18.5959V26.6807H16.5615ZM25.7818 26.6807H20.6631V18.7565H25.7818V26.6807ZM27.8326 16.837H20.6631V14.7206H27.8326V16.837Z"
            fill="#1877F2"
          />
          <defs>
            <filter
              id="filter0_i_948_2813"
              x="0.5"
              y="0.5"
              width="38"
              height="40"
              filterUnits="userSpaceOnUse"
              colorInterpolationFilters="sRGB"
            >
              <feFlood floodOpacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feColorMatrix
                in="SourceAlpha"
                type="matrix"
                values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                result="hardAlpha"
              />
              <feOffset dx="3" dy="5" />
              <feGaussianBlur stdDeviation="5" />
              <feComposite
                in2="hardAlpha"
                operator="arithmetic"
                k2="-1"
                k3="1"
              />
              <feColorMatrix
                type="matrix"
                values="0 0 0 0 0.0588235 0 0 0 0 0.0862745 0 0 0 0 0.117647 0 0 0 0.08 0"
              />
              <feBlend
                mode="normal"
                in2="shape"
                result="effect1_innerShadow_948_2813"
              />
            </filter>
          </defs>
        </svg>

        <span>이벤트</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="36"
          height="36"
          viewBox="0 0 36 36"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_i_948_2820)">
            <circle cx="18" cy="18" r="17.5" fill="#1877F2" />
          </g>
          <circle cx="18" cy="18" r="17" stroke="#E3E6EA" />
          <path
            d="M6.86328 20.7842H9.77995V28.0758H6.86328V20.7842ZM12.6966 16.4092H15.6133V28.0758H12.6966V16.4092ZM18.5299 12.0342H21.4466V28.0758H18.5299V12.0342ZM24.3633 7.65918H27.2799V28.0758H24.3633V7.65918Z"
            fill="white"
          />
          <defs>
            <filter
              id="filter0_i_948_2820"
              x="0.5"
              y="0.5"
              width="38"
              height="40"
              filterUnits="userSpaceOnUse"
              colorInterpolationFilters="sRGB"
            >
              <feFlood floodOpacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feColorMatrix
                in="SourceAlpha"
                type="matrix"
                values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                result="hardAlpha"
              />
              <feOffset dx="3" dy="5" />
              <feGaussianBlur stdDeviation="5" />
              <feComposite
                in2="hardAlpha"
                operator="arithmetic"
                k2="-1"
                k3="1"
              />
              <feColorMatrix
                type="matrix"
                values="0 0 0 0 0.0588235 0 0 0 0 0.0862745 0 0 0 0 0.117647 0 0 0 0.08 0"
              />
              <feBlend
                mode="normal"
                in2="shape"
                result="effect1_innerShadow_948_2820"
              />
            </filter>
          </defs>
        </svg>

        <span>광고 관리자</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="36"
          height="36"
          viewBox="0 0 36 36"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_i_948_2827)">
            <circle cx="18" cy="18" r="17.5" fill="white" />
          </g>
          <circle cx="18" cy="18" r="17" stroke="#E3E6EA" />
          <path
            d="M7.39779 20.4521C7.39779 21.498 7.62451 22.3009 7.92074 22.7867C8.3092 23.4229 8.88846 23.6925 9.47913 23.6925C10.2409 23.6925 10.9379 23.5009 12.2809 21.6198C13.3569 20.1121 14.6247 17.9956 15.4777 16.6688L16.9224 14.4209C17.926 12.8598 19.0874 11.1244 20.4193 9.94808C21.5063 8.98794 22.6792 8.45459 23.8595 8.45459C25.8412 8.45459 27.7288 9.61758 29.1735 11.7988C30.7545 14.1876 31.522 17.1965 31.522 20.3016C31.522 22.1475 31.1628 23.5038 30.5514 24.5755C29.9608 25.6118 28.8095 26.6471 26.8731 26.6471V23.6925C28.5312 23.6925 28.945 22.1494 28.945 20.3835C28.945 17.8671 28.3656 15.0743 27.0894 13.079C26.1836 11.6635 25.0099 10.7987 23.7186 10.7987C22.3219 10.7987 21.1979 11.8654 19.9348 13.7677C19.2633 14.7782 18.5739 16.0098 17.7999 17.3994L16.9478 18.9281C15.236 22.0018 14.8024 22.7018 13.9466 23.8572C12.4464 25.8804 11.1656 26.6471 9.47913 26.6471C7.47871 26.6471 6.2136 25.7698 5.43023 24.4478C4.79065 23.3705 4.47656 21.9571 4.47656 20.3464L7.39779 20.4521Z"
            fill="#0081FB"
          />
          <path
            d="M6.78125 12.0073C8.12063 9.91673 10.0533 8.45459 12.2701 8.45459C13.554 8.45459 14.8302 8.83944 16.163 9.94144C17.6207 11.1463 19.1744 13.1303 21.1128 16.4003L21.808 17.5736C23.4857 20.4045 24.4403 21.8608 24.999 22.5477C25.7176 23.4296 26.2208 23.6925 26.8744 23.6925C28.5326 23.6925 28.9464 22.1494 28.9464 20.3835L31.5234 20.3016C31.5234 22.1475 31.1642 23.5038 30.5528 24.5755C29.9622 25.6118 28.8109 26.6471 26.8744 26.6471C25.6706 26.6471 24.6041 26.3823 23.4247 25.2555C22.518 24.3907 21.4581 22.8543 20.6426 21.4731L18.2169 17.3698C17 15.3106 15.8835 13.7752 15.2375 13.0798C14.5426 12.3322 13.649 11.4292 12.2232 11.4292C11.0692 11.4292 10.0891 12.2493 9.26901 13.5037L6.78125 12.0073Z"
            fill="url(#paint0_linear_948_2827)"
          />
          <path
            d="M12.2217 11.4292C11.0677 11.4292 10.0876 12.2493 9.26752 13.5037C8.10794 15.2763 7.39779 17.9166 7.39779 20.4521C7.39779 21.498 7.62451 22.3009 7.92074 22.7867L5.43023 24.4478C4.79065 23.3705 4.47656 21.9571 4.47656 20.3464C4.47656 17.4174 5.27039 14.3648 6.77986 12.0073C8.11925 9.91673 10.0519 8.45459 12.2687 8.45459L12.2217 11.4292Z"
            fill="url(#paint1_linear_948_2827)"
          />
          <defs>
            <filter
              id="filter0_i_948_2827"
              x="0.5"
              y="0.5"
              width="38"
              height="40"
              filterUnits="userSpaceOnUse"
            >
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feColorMatrix
                in="SourceAlpha"
                type="matrix"
                values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                result="hardAlpha"
              />
              <feOffset dx="3" dy="5" />
              <feGaussianBlur stdDeviation="5" />
              <feComposite
                in2="hardAlpha"
                operator="arithmetic"
                k2="-1"
                k3="1"
              />
              <feColorMatrix
                type="matrix"
                values="0 0 0 0 0.0588235 0 0 0 0 0.0862745 0 0 0 0 0.117647 0 0 0 0.08 0"
              />
              <feBlend
                mode="normal"
                in2="shape"
                result="effect1_innerShadow_948_2827"
              />
            </filter>
            <linearGradient
              id="paint0_linear_948_2827"
              x1="350.153"
              y1="1026.04"
              x2="2210.27"
              y2="1118.8"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#0064E1" />
              <stop offset="0.4" stopColor="#0064E1" />
              <stop offset="0.83" stopColor="#0073EE" />
              <stop offset="1" stopColor="#0082FB" />
            </linearGradient>
            <linearGradient
              id="paint1_linear_948_2827"
              x1="427.707"
              y1="1332.41"
              x2="427.707"
              y2="637.1"
              gradientUnits="userSpaceOnUse"
            >
              <stop stopColor="#0082FB" />
              <stop offset="1" stopColor="#0064E0" />
            </linearGradient>
          </defs>
        </svg>

        <span>Meta Quest</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="28"
          height="28"
          viewBox="0 0 28 28"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M26.0591 0.907593C24.849 -0.302531 22.8929 -0.302531 21.6828 0.907593L20.0195 2.5653L25.4292 7.97494L27.0924 6.31171C28.3025 5.10158 28.3025 3.14549 27.0924 1.93537L26.0591 0.907593ZM9.52627 13.0641C9.18921 13.4012 8.9295 13.8156 8.7803 14.2742L7.1447 19.181C6.98446 19.6562 7.11155 20.1812 7.46519 20.5403C7.81884 20.8995 8.34378 21.0211 8.82451 20.8608L13.7313 19.2252C14.1844 19.076 14.5988 18.8163 14.9414 18.4793L24.1859 9.22927L18.7707 3.8141L9.52627 13.0641ZM5.30465 3.24496C2.37604 3.24496 0 5.621 0 8.54961V22.6953C0 25.624 2.37604 28 5.30465 28H19.4504C22.379 28 24.755 25.624 24.755 22.6953V17.3907C24.755 16.4126 23.9649 15.6225 22.9868 15.6225C22.0088 15.6225 21.2186 16.4126 21.2186 17.3907V22.6953C21.2186 23.6734 20.4284 24.4636 19.4504 24.4636H5.30465C4.32661 24.4636 3.53644 23.6734 3.53644 22.6953V8.54961C3.53644 7.57156 4.32661 6.78139 5.30465 6.78139H10.6093C11.5874 6.78139 12.3775 5.99122 12.3775 5.01317C12.3775 4.03513 11.5874 3.24496 10.6093 3.24496H5.30465Z"
            fill="#1A74E4"
          />
        </svg>

        <span>게시물</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="32"
          height="26"
          viewBox="0 0 32 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M13.8667 25.1813C14.4667 25.3924 15.1111 24.9535 15.1111 24.3202V3.35354C15.1111 3.1202 15.0222 2.88687 14.8333 2.74243C13.7444 1.87576 11.2444 0.764648 8 0.764648C5.19444 0.764648 2.57222 1.50354 1.00556 2.10354C0.377778 2.34798 0 2.9702 0 3.64243V24.2146C0 24.8758 0.711111 25.3369 1.33889 25.1313C3.08889 24.548 5.86111 23.8758 8 23.8758C9.88333 23.8758 12.3889 24.6535 13.8667 25.1813ZM18.1333 25.1813C19.6111 24.6535 22.1167 23.8758 24 23.8758C26.1389 23.8758 28.9111 24.548 30.6611 25.1313C31.2889 25.3424 32 24.8758 32 24.2146V3.64243C32 2.9702 31.6222 2.34798 30.9944 2.10909C29.4278 1.50354 26.8056 0.764648 24 0.764648C20.7556 0.764648 18.2556 1.87576 17.1667 2.74243C16.9833 2.88687 16.8889 3.1202 16.8889 3.35354V24.3202C16.8889 24.9535 17.5389 25.3924 18.1333 25.1813Z"
            fill="#1A74E4"
          />
        </svg>

        <span>스토리</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="28"
          height="26"
          viewBox="0 0 28 26"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M24.5 0.75H19.7914L19.7367 0.804688L12.7914 7.75H17.8281L17.8828 7.69531L24.8172 0.766406C24.7133 0.755469 24.6094 0.75 24.5 0.75ZM28 7.75V4.25C28 3.42422 27.7102 2.65859 27.2344 2.0625L21.5469 7.75H28ZM16.0836 0.75H11.0469L10.9922 0.804688L4.04141 7.75H9.07812L9.13281 7.69531L16.0781 0.75H16.0836ZM3.5 0.75C1.56953 0.75 0 2.31953 0 4.25V7.75H0.333594L0.388281 7.69531L7.33359 0.75H3.5ZM28 9.5H0V21.75C0 23.6805 1.56953 25.25 3.5 25.25H24.5C26.4305 25.25 28 23.6805 28 21.75V9.5Z"
            fill="#1A74E4"
          />
        </svg>

        <span>릴스</span>
      </Item>
      <Item onClick={() => alert("서비스 준비중 입니다")}>
        <svg
          width="24"
          height="28"
          viewBox="0 0 24 28"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M6.85714 0.285645C7.80536 0.285645 8.57143 1.05172 8.57143 1.99993V3.71422H15.4286V1.99993C15.4286 1.05172 16.1946 0.285645 17.1429 0.285645C18.0911 0.285645 18.8571 1.05172 18.8571 1.99993V3.71422H21.4286C22.8482 3.71422 24 4.866 24 6.28565V8.85707H0V6.28565C0 4.866 1.15179 3.71422 2.57143 3.71422H5.14286V1.99993C5.14286 1.05172 5.90893 0.285645 6.85714 0.285645ZM0 10.5714H24V25.1428C24 26.5624 22.8482 27.7142 21.4286 27.7142H2.57143C1.15179 27.7142 0 26.5624 0 25.1428V10.5714ZM3.42857 14.8571V16.5714C3.42857 17.0428 3.81429 17.4285 4.28571 17.4285H6C6.47143 17.4285 6.85714 17.0428 6.85714 16.5714V14.8571C6.85714 14.3856 6.47143 13.9999 6 13.9999H4.28571C3.81429 13.9999 3.42857 14.3856 3.42857 14.8571ZM10.2857 14.8571V16.5714C10.2857 17.0428 10.6714 17.4285 11.1429 17.4285H12.8571C13.3286 17.4285 13.7143 17.0428 13.7143 16.5714V14.8571C13.7143 14.3856 13.3286 13.9999 12.8571 13.9999H11.1429C10.6714 13.9999 10.2857 14.3856 10.2857 14.8571ZM18 13.9999C17.5286 13.9999 17.1429 14.3856 17.1429 14.8571V16.5714C17.1429 17.0428 17.5286 17.4285 18 17.4285H19.7143C20.1857 17.4285 20.5714 17.0428 20.5714 16.5714V14.8571C20.5714 14.3856 20.1857 13.9999 19.7143 13.9999H18ZM3.42857 21.7142V23.4285C3.42857 23.8999 3.81429 24.2856 4.28571 24.2856H6C6.47143 24.2856 6.85714 23.8999 6.85714 23.4285V21.7142C6.85714 21.2428 6.47143 20.8571 6 20.8571H4.28571C3.81429 20.8571 3.42857 21.2428 3.42857 21.7142ZM11.1429 20.8571C10.6714 20.8571 10.2857 21.2428 10.2857 21.7142V23.4285C10.2857 23.8999 10.6714 24.2856 11.1429 24.2856H12.8571C13.3286 24.2856 13.7143 23.8999 13.7143 23.4285V21.7142C13.7143 21.2428 13.3286 20.8571 12.8571 20.8571H11.1429ZM17.1429 21.7142V23.4285C17.1429 23.8999 17.5286 24.2856 18 24.2856H19.7143C20.1857 24.2856 20.5714 23.8999 20.5714 23.4285V21.7142C20.5714 21.2428 20.1857 20.8571 19.7143 20.8571H18C17.5286 20.8571 17.1429 21.2428 17.1429 21.7142Z"
            fill="#1A74E4"
          />
        </svg>

        <span>중요이벤트</span>
      </Item>
    </Wrapper>
  );
};

export default SideBarMenu;
